Repository: Arcols/Eat-and-Hit
Catalog: lib/l10n/app_*.arb
Languages: fr

# moncompte_titrepage
source: My Account
fr: Mon Compte

# moncompte_totalFoodGiven
source: Total lunch given: {count} times
fr: Nombre de pains (nourriture) donnés : {count} fois

# moncompte_totalHitsGiven
source: Total punch given: {count} times
fr: Nombre de pains (coups) donnés : {count} fois

# moncompte_happyStudents
source: Number of happy students: {count}
fr: Nombre d'étudiants contents : {count}

# moncompte_unhappyStudents
source: Number of unhappy students: {count}
fr: Nombre d'étudiants pas contents : {count}

# moncompte_etat_gentil
source: You are kindness incarnate! Stay like that! (or not...)
fr: Vous avez la bonté incarnée ! Restez comme ça ! (ou pas...)

# moncompte_etat_pasgentil
source: You are pure evil! HAHAHA!
fr: Vous êtes le mal incarné ! HIHIHI !

# moncompte_etat_passigentil
source: You keep attacking certain students! It's not nice to be mean!
fr: Vous vous acharnez sur certains étudiants ! C'est pas gentil d'être méchant !

# moncompte_etat_unpeugentil
source: You appreciate very few students! Food can be shared!
fr: Vous appréciez très peu d'étudiants ! La nourriture peu se partager !

# moncompte_etat_pasgentildutout
source: You really don't like students. There are other jobs, you know?
fr: Vous aimez vraiment pas les étudiants, il existe d'autres métiers vous savez ?

# moncompte_etat_supergentil
source: This job is truly made for you, you really appreciate your students!
fr: Ce métier est vraiment fait pour vous, vous appréciez vraiment vos étudiants !

# moncompte_etat_normal
source: Everything is balanced, it's becoming suspicious
fr: Tout est équilibré, ça en devient suspect

# moncompte_etat_vide
source: Nothing has happened yet...
fr: Rien ne s'est passé pour l'instant ...

# main_etudiant_ajoute
source: The student {name} has been successfully added
fr: L'étudiant {name} a bien été ajouté

# main_moncompte
source: My Account
fr: Mon compte

# details_eleves_nbfoisnourri
source: Has been fed {count} times :)
fr: A été nourri {count} fois :)

# details_eleves_nbfoisfrappe
source: Has been hit {count} times :(
fr: A été frappé {count} fois :(

# parametres_credit
source: Credits
fr: Crédits

# parametres_devpar
source: Developed by Arthur Colson & Indi Blateau
fr: Développé par Arthur Colson & Indi Blateau

# add_etudiant_titre
source: Add a student
fr: Ajouter un étudiant

# add_etudiant_homme
source: Male
fr: Homme

# add_etudiant_femme
source: Female
fr: Femme

# add_etudiant_nom
source: Last name
fr: Nom

# add_etudiant_prenom
source: First name
fr: Prénom

# add_etudiant_aimesefairetaper
source: Your student likes to be hit
fr: Votre étudiant aime se faire frapper

# add_etudiant_aimepasefairetaper
source: Your student doesn't like to be hit
fr: Votre étudiant n\'aime pas se faire frapper

# add_etudiant_snackbar_error
source: Please enter the student's first and last name!
fr: Veuillez renseigner le nom et le prénom de l\'étudiant !

# add_etudiant_addbutton
source: Add the student !
fr: Ajouter l\'étudiant !
